app/controllers/accounts_controller.rb

  def index
  #collective accounts of a perticualr user of whome he is admin
  @accounts = Account.where(user_id: current_user.id)
  @invitation = Invitation.select(:acc_id).where(mem_id: current_user.id)
  @aa = Account.where(id: @invitation)
---
SELECT `accounts`.* FROM `accounts` WHERE `accounts`.`id` IN (SELECT `invitations`.`acc_id` FROM `invitations` WHERE `invitations`.`mem_id` = 1)