app/controllers/accounts_controller.rb

  def index
  #collective accounts of a perticualr user of whome he is admin
  #@accounts = Account.where(user_id: current_user.id)
     @accounts = Account.current_user_accounts(current_user)
  #stores all accounts in variable for current user
  #@invitation_acc = Invitation.select(:acc_id).where(mem_id: current_user.id)
      #@invitation_acc = Invitation.current_user_invitation(current_user)
  @aa = Account.where(id: Invitation.current_user_invitation(current_user))
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 5 ORDER BY `users`.`id` ASC LIMIT 1
SELECT COUNT(*) FROM `accounts` WHERE `accounts`.`user_id` = 6
SELECT `accounts`.* FROM `accounts` WHERE `accounts`.`user_id` = 1
SELECT `invitations`.* FROM `invitations` WHERE `invitations`.`acc_id` = 5

  def create
    #assing diffrent parameters to insatnce variable
    @account = Account.new(account_params)
    #assigning current user_id to account user_id
    @account.user_id = current_user.id

    #redirection path
    if @account.save
---
INSERT INTO `accounts` (`name`, `created_at`, `updated_at`, `user_id`) VALUES ('dfsvgsdd', '2018-03-26 12:02:22', '2018-03-26 12:02:22', 5)

  def show
    #to show perticular account number
    @account = Account.find(params[:id])
    #declaring insatnce variable for invitation
    @invitation =Invitation.new
    #@temp = Invitation.select(:mem_id).where(acc_id: params[:id])
    @temp = Invitation.select_mem_id(params[:id])
    @members = User.where(id: @temp)
---
SELECT  `accounts`.* FROM `accounts` WHERE `accounts`.`id` = 16 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` IN (SELECT `invitations`.`mem_id` FROM `invitations` WHERE `invitations`.`acc_id` = 2)