app/controllers/invitations_controller.rb

  def show
    id = params[:id]
    @invitation = Invitation.find(id)
---
SELECT  `invitations`.* FROM `invitations` WHERE `invitations`.`id` = 1 LIMIT 1

  def create
    #using exception handling
    begin
      #assigning invite email from invitatiion hash to variable email
      if params[:invitation][:invite_email] != current_user.email
      email = params[:invitation][:invite_email]
      @user = User.find_by_email(email)

      if @user.present?
        #if user present create inviatation with the parameters assignmenet
        @invitation = Invitation.create!(acc_id: params[:acc_id],mem_id: @user.id,invite_email: @user.email)
      else
        #if user not present then insert in account id and invite email feild
        @invitation = Invitation.create!(acc_id: params[:acc_id],invite_email: params[:invitation][:invite_email])
      end
    end
      #logic for sending emailinvitation_path(@invitation.id)
      #invitation path of that inviatation i.e. url,emailand account name
      InvitationMailer.invitation_mail(invitation_path(@invitation.id),params[:invitation][:invite_email],Account.find(params[:acc_id].to_i).name).deliver_now
---
SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'prashant080994@gmail.com' LIMIT 1
INSERT INTO `invitations` (`mem_id`, `acc_id`, `invite_email`, `created_at`, `updated_at`, `token`) VALUES (7, 4, 'prashant080994@gmail.com', '2018-04-10 05:38:48', '2018-04-10 05:38:48', 'f5f167e99886cf94a7be2c920c39dd448c032bb8')
SELECT  `accounts`.* FROM `accounts` WHERE `accounts`.`id` = 19 LIMIT 1