app/controllers/teams_controller.rb

  def addmember
    @team = Team.find(params[:team_id])
---
SELECT  `teams`.* FROM `teams` WHERE `teams`.`id` = NULL LIMIT 1