app/controllers/teams_controller.rb

SELECT `teams`.* FROM `teams`
SELECT `teams`.* FROM `teams` WHERE `teams`.`id` IN (SELECT `team_members`.`team_id` FROM `team_members` WHERE `team_members`.`mem_id` = 7)
SELECT  `teams`.* FROM `teams` WHERE `teams`.`id` = 0 LIMIT 1
---
  def index
    @team =Team.new
    # new_team
    @teams = Team.all
    # all_team
      #@my_teams = Team.where(user_id: current_user.id)
      @my_teams = Team.my_teams(current_user)
      #@temp = TeamMember.select(:team_id).where(mem_id: current_user.id)
      @temp = TeamMember.select_team_id(current_user)
      @other_teams = Team.where(id: @temp)

SELECT  `teams`.* FROM `teams` WHERE `teams`.`id` = 1 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` IN (SELECT `invitations`.`mem_id` FROM `invitations` WHERE `invitations`.`acc_id` = 55)
SELECT  `team_members`.* FROM `team_members` WHERE `team_members`.`id` = NULL LIMIT 1
---
  def show
    @team = Team.find(params[:id])
    #@temp = Invitation.select(:mem_id).where(acc_id: params[:account_id])
    @temp = Invitation.current_account_mem_id(params[:account_id])
    @members = User.where(id: @temp)
    @team_mem = TeamMember.new
    @tmid = TeamMember.select(:mem_id)
    @team_members = User.where(id: @tmid)

INSERT INTO `teams` (`name`, `acc_id`, `user_id`, `created_at`, `updated_at`) VALUES ('dsadsa', 10, 7, '2018-04-09 07:34:41', '2018-04-09 07:34:41')
---
  def create
    @team = Team.new(team_params)
    @team.user_id = current_user.id
      if  @team.save

INSERT INTO `team_members` (`team_id`, `mem_id`, `created_at`, `updated_at`) VALUES (1, 1, '2018-04-06 07:40:50', '2018-04-06 07:40:50')
---
  def addmember
      @userids = params[:ids]
        @userids.each do |a|
        @team_mem = TeamMember.create(team_id: params[:team_id].to_i, mem_id: a.to_i)