app/controllers/users/registrations_controller.rb

INSERT INTO `accounts` (`name`, `created_at`, `updated_at`, `user_id`) VALUES ('asd', '2018-03-26 09:14:06', '2018-03-26 09:14:06', 4)
INSERT INTO `users` (`email`, `encrypted_password`, `created_at`, `updated_at`) VALUES ('prashant@abc.com', '$2a$11$SGusRhKGLwauungA.b9h6.QQLsZmNqfkLiUaSNzBzfU5EoJ7Bjjgi', '2018-03-26 07:17:31', '2018-03-26 07:17:31')
---
   def create
    # @name = params[:user][:name]
     super
     #byebug
      Account.create(name: params[:account_name], user_id: current_user.id)